logintb = {Name = "登入",
  {Name = "1登入界面",
    Color = {
      {359,376,0x831412},
      {330,444,0xd8e1eb},
      {601,454,0x131152},
      {703,568,0xfee5d1},
      {1247,443,0x6bbdd5},
      {1237,589,0x5692b7},
      {1292,663,0xbfd4e2},
    },
    Run = (function()
    tap(972,894)
  end)
},
{Name = "2账号登陆界面",
  Color = {
    {494,360,0xe60012},
    {501,473,0xe60516},
    {504,535,0x3d3a39},
    {727,494,0xffffff},
    {727,502,0x37b86e},
    {874,732,0xffffff},
    {875,741,0x22b260},
  },
  Run = (function()
  tap(966,685)
end)
},

{Name = "2账号登陆界面(模拟器)",
  Color = {
    {716,399,0xffffff},
    {748,415,0xe60012},
    {771,444,0xc1c1c2},
    {770,462,0xc1c1c2},
    {771,483,0xffffff},
    {771,496,0xffffff},
    {771,518,0x37b86e},
  },
  Run = (function()
  tap(966,685)
end)
},


{Name = "3选择账号方式（有快速登陆）",
  Color = {
    {704,305,0x08061e},
    {712,547,0x079ddb},
    {718,578,0xffffff},
    {714,614,0x079ddb},
    {924,586,0x3cdedf},
    {969,606,0xffffff},
    {1180,577,0xd1201f},
    {1233,619,0xd1201f},
  },
  Run = (function()
  tap(1207,587)
end)
},

{Name = "4选择账号方式（无快速登陆）",
  Color = {
    {641,272,0x07061e},
    {693,300,0x06061e},
    {714,426,0xffffff},
    {732,574,0x3cdedf},
    {973,591,0xffffff},
    {1098,595,0xd1201f},
  },
  Run = (function()
  tap(1180,582)
end)
},
{Name = "5网易邮箱账号登陆",
  Color = {
    {482,332,0xffffff},
    {515,361,0xe9202f},
    {615,356,0xffffff},
    {613,475,0xc1c1c2},
    {614,516,0xc1c1c2},
    {698,529,0xc1c1c2},
    {698,525,0xffffff},
    {697,535,0xffffff},
    {696,544,0x8fdaae},
  },
  Run = (function()
  inputAcctMobi()
end)
},
{Name = "5网易邮箱账号登陆(模拟器)",
  Color = {
    {702,384,0xffffff},
    {726,420,0xe60012},
    {770,402,0xc1c1c2},
    {770,425,0xc1c1c2},
    {770,468,0xc1c1c2},
    {770,505,0xc1c1c2},
    {770,559,0x8fdaae},
  },
  Run = (function()
  inputAcctSim()
end)
},

{Name = "6签协议",
  Color = {
    {276,396,0xa7c8ff},
    {297,388,0x86b6dc},
    {314,438,0x91c2e8},
    {490,441,0xf3f3f3},
    {797,945,0xcf4231},
    {1094,952,0x23b260},
  },
  Run = (function()
  tap(1199,954)
end)
},

{Name = "7取名字",
  Color = {
    {491,494,0x6d94cc},
    {553,539,0x6289cf},
    {314,438,0x91c2e8},
    {751,728,0xfffffb},
    {991,751,0xe4dcd4},
    {1004,746,0xe4dcd4},
    {1162,749,0xe4dcd4},
    {932,841,0xf4b25f},
    {959,897,0xf4b25f},
    {988,896,0xf4b25f},
  },
  Run = (function()
  tap(753,738)
  ss()
  tap(960,855)
end)
},

{Name = "8点击进入游戏",
  Color = {
    {200,592,0xaaebff},
    {499,539,0x4264b7},
    {647,533,0xd9d7e5},
    {879,640,0x94c2f7},
    {942,881,0x42626d},
    {1011,890,0x43636e},
    {1032,980,0x0b143d},
    {1153,937,0x081028},
  },
  Run = (function()
  tap(987,772)
  return true
end)
},

{Name = "9庭院界面",
  Color = {
    {419,15,0x432222},
    {460,15,0x432222},
    {562,14,0x482525},
    {632,14,0x9a795b},
    {1756,46,0xd5c4a2},
    {1854,46,0xd5c4a2},
  },
  Run = (function()
  return true
end)
},
sleep = 1000,
csim = 90
}



changeAccttb = {Name = "变更账号",
  {Name = "1庭院界面",
    Color = {
      {419,15,0x432222},
      {460,15,0x432222},
      {562,14,0x482525},
      {632,14,0x9a795b},
      {1756,46,0xd5c4a2},
      {1854,46,0xd5c4a2},
    },
    Run = (function()
    tap(94,85)
  end)
},
{Name = "2设置界面",
  Color = {
    {470,129,0x483726},
    {599,205,0xc6bdb5},
    {784,215,0xc6b59e},
    {1192,283,0x371f0e},
    {1198,450,0xd8c8b7},
    {1569,165,0xe6d5cd},
  },
  Run = (function()
  tap(1237,283)
end)
},
{Name = "3用户界面",
  Color = {
    {1205,87,0xf8f8f8},
    {1619,56,0x22b260},
    {282,469,0x19b063},
    {409,553,0xffffff},
    {692,483,0x19b063},
    {643,350,0xffffff},
  },
  Run = (function()
  tap(1664,75)
  return true
end)
},
{Name = "3用户界面(模拟器)",
  Color = {
    {33,41,0x191919},
    {505,61,0xf8f8f8},
    {1214,48,0xf8f8f8},
    {1232,176,0xffffff},
    {1861,46,0x22b260},
  },
  Run = (function()
  tap(1830,50)
  return true
end)
},
sleep = 1000,
csim = 90
}

getMailtb = {Name = "收信",
  {Name = "1庭院界面(有邮件)",
    Color = {
      {419,15,0x432222},
      {460,15,0x432222},
      {562,14,0x482525},
      {632,14,0x9a795b},
      {1756,46,0xd5c4a2},
      {1854,46,0xd5c4a2},
      {1784,26,0xff1515},
      {1781,27,0xff0b0b},
      {1756,45,0xd5c4a2},
    },
    Run = (function()
    tap(1760,50)
  end)
},

{Name = "2邮件列表",
  Color = {
    {507,50,0x392920},
    {516,84,0x483726},
    {247,146,0x8d5b2a},
    {263,206,0x40403e},
    {688,244,0xd8c8b7},
    {445,266,0xd8c8b7},
    {1744,111,0x733a3a},
  },
  Run = (function()
  while true do
    printFunction("检查邮件")
    local x, y = findMultiColorInRegionFuzzy(0xd8c8b7,"5|38|0xd8c8b7,6|9|0xd8c8b7", 95, 718,250,724,288)
    if x ~= -1 and y ~= -1 then
      printFunction("点邮件收取")
      tap (x,y)
      ss()
      tap(1262,907)
			ss(5*1000)
    else
      break
    end
  end
  tap(1761,105)
end)
},

{Name = "3获取奖励",
  Color = {
	{651,359,0x3a2a21},
	{526,475,0xaf9f97},
	{551,514,0x8a693f},
	{706,436,0xccb49b},
	{1252,444,0xccb49b},
	{1394,479,0xb2a299},
	{1381,553,0x89683e},
	{912,323,0xfef2c1},
	{1041,356,0xe9e0a7},
},
  Run = (function()
		tap(1262,907)
end)
},


{Name = "4庭院界面(无邮件)",
  Color = {
    {419,15,0x432222},
    {460,15,0x432222},
    {562,14,0x482525},
    {632,14,0x9a795b},
    {1756,46,0xd5c4a2},
    {1854,46,0xd5c4a2},
		{1777,29,0x352813},
		{1780,32,0x3d2c1c},
		{1784,34,0x3b312e},
  },
  Run = (function()
  return true
end)
},
sleep = 1000,
csim = 90
}


getSSRtb = {Name = "抽！！",
{Name = "1庭院界面",
  Color = {
    {419,15,0x432222},
    {460,15,0x432222},
    {562,14,0x482525},
    {632,14,0x9a795b},
    {1756,46,0xd5c4a2},
    {1854,46,0xd5c4a2},
  },
  Run = (function()
  tap(1615,365)
end)
},

{Name = "2召唤大厅界面",
  Color = {
	{356,44,0x3c1b0b},
	{405,32,0x7f4d24},
	{511,33,0x3d2915},
	{747,41,0xcdd0d2},
	{757,29,0xa1a8ad},
	{1062,30,0x82b3cc},
	{1357,51,0xd0b194},
	{1381,45,0xea361e},
},
  Run = (function()
		tap(988,881)
		ss()
		tap(1391,907)
end)
},

{Name = "3抽取结果界面",
  Color = {
	{830,774,0xf18029},
	{882,773,0xf38630},
	{684,954,0xf4b25f},
	{826,967,0xf4b25f},
	{1112,943,0xf3b25e},
	{1187,871,0x87b6ce},
},
  Run = (function()
	tap(755,948)
end)
},

{Name = "4画符界面",
  Color = {
	{347,838,0x32b6d7},
	{392,895,0xe4ccdd},
	{555,844,0xb7b4b7},
	{767,921,0x201818},
	{848,925,0x201819},
	{1370,879,0xb6b3b6},
	{1630,844,0x947b52},
	{1628,869,0x947b52},
},
  Run = (function()
		local xp, yp, dis = waitRandom(_fsh/3-50,_fsh/3+50), waitRandom(_fsw/2-20,_fsw/2+20),waitRandom(_fsh/3.2,_fsh/3.2+150)
    swip(xp,yp,xp+dis,yp)
		ss(5*1000)
end)
},

{Name = "5获取奖励",
  Color = {
	{651,359,0x3a2a21},
	{526,475,0xaf9f97},
	{551,514,0x8a693f},
	{706,436,0xccb49b},
	{1252,444,0xccb49b},
	{1394,479,0xb2a299},
	{1381,553,0x89683e},
	{912,323,0xfef2c1},
	{1041,356,0xe9e0a7},
},
  Run = (function()
		tap(1262,907)
end)
},

{Name = "6勾玉不足",
  Color = {
	{706,354,0x654433},
	{724,407,0xccb49b},
	{727,564,0xccb49b},
	{729,602,0xf5b15d},
	{961,610,0xccb49b},
	{1084,613,0xf4b25f},
},
  Run = (function()
		tap(769,634)
		ss()
		tap(85,50)
		return true
end)
},



sleep = 1000,
csim = 90
}


getAchievetb = {Name = "获取成就",
  {Name = "1庭院界面(有任务)",
    Color = {
      {419,15,0x432222},
      {460,15,0x432222},
      {562,14,0x482525},
      {632,14,0x9a795b},
      {1756,46,0xd5c4a2},
      {1854,46,0xd5c4a2},
			{970,905,0xcfc7bf},
			{1057,895,0xcec6be},
			{1074,873,0xff0404},
			{1085,868,0xff2828},
			{1033,926,0x6a3030},
    },
    Run = (function()
    tap(987,940)
  end)
},

{Name = "2成就列表(有成就)",
  Color = {
	{594,48,0x392920},
	{604,78,0x483726},
	{918,83,0xf8f3e0},
	{937,91,0xf8f3e0},
	{953,84,0x665545},
	{976,86,0xf8f3e0},
	{1746,113,0x753232},
	{1769,113,0xecd3d3},
	{1849,452,0xa30016},
	{1857,465,0xa30016},
},
  Run = (function()
	tap(1822,519)
  while true do
    local x, y = findMultiColorInRegionFuzzy(0xf4b25f,"16|11|0xf4b25f", 95, 1582, 224, 1598, 235)
    if x > -1 then
      tap(x,y)
      ss()
    else
      break
    end
  end
end)
},

{Name = "3获取奖励",
  Color = {
	{651,359,0x3a2a21},
	{526,475,0xaf9f97},
	{551,514,0x8a693f},
	{706,436,0xccb49b},
	{1252,444,0xccb49b},
	{1394,479,0xb2a299},
	{1381,553,0x89683e},
	{912,323,0xfef2c1},
	{1041,356,0xe9e0a7},
},
  Run = (function()
		tap(1262,907)
end)
},


{Name = "4庭院界面(卷抽关闭)",
  Color = {
    {419,15,0x432222},
    {460,15,0x432222},
    {562,14,0x482525},
    {632,14,0x9a795b},
    {1756,46,0xd5c4a2},
    {1854,46,0xd5c4a2},
		{1833,889,0x956241},
		{1813,921,0xd6c6be},
		{1800,947,0x90281a},
		{1778,1012,0xae7d5c},
  },
  Run = (function()
  tap(1793,937)
end)
},

{Name = "4有技能升级",
  Color = {
	{597,446,0x7d7575},
	{591,493,0xb1a1a1},
	{632,537,0x805f36},
	{940,417,0x423120},
	{954,426,0x463524},
	{1319,484,0xa99991},
	{1298,540,0x8b6a40},
},
  Run = (function()
  tap(1262,907)
end)
},

{Name = "2成就列表(无成就)",
  Color = {
	{594,48,0x392920},
	{604,78,0x483726},
	{918,83,0xf8f3e0},
	{937,91,0xf8f3e0},
	{953,84,0x665545},
	{976,86,0xf8f3e0},
	{1746,113,0x753232},
	{1769,113,0xecd3d3},
	{1857,449,0x864c1a},
	{1860,453,0xf9f0d8},
	{1864,446,0x764321},
},
  Run = (function()
	tap(1764,117)
	return true
end)
},


sleep = 1000,
csim = 90
}





